Merge branch 'main' of https://github.com/filipR1624/thanos-operator
